**Цель работы:**

Осуществить предварительную обработку данных csv-файла, выявить и устранить проблемы в этих данных.

# Загрузка набора данных

### Описание предметной области

Вариант №14

Набор данных: clients.csv

Атрибуты: ID, Year_Birth, Education, Marital_Status, Income, Kidhome, Dt_Customer, NumDealsPurchases

### 1.Чтение файла (набора данных)

In [1]:
# импорт библиотек, чтение файла с помощью pandas
import pandas as pd
df = pd.read_csv('C:\\Users\\Максим\\Desktop\\учеба вуз\\clients.csv', sep=';') # чтение таблицы

### 2. Обзор данных

2.1 Вывод первых 20 строк с помощью метода head.

In [2]:
# применить метод head
df.head(20)

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Dt_Customer,NumDealsPurchases
0,5524,1957,Graduation,Single,58138.0,0.0,04.09.2012,3.0
1,2174,1954,Graduation,Single,46344.0,1.0,08.03.2014,2.0
2,4141,1965,Graduation,Together,71613.0,0.0,21.08.2013,1.0
3,6182,1984,Graduation,Together,26646.0,1.0,10.02.2014,2.0
4,5324,1981,PhD,Married,58293.0,1.0,19.01.2014,5.0
5,7446,1967,Master,Together,62513.0,0.0,09.09.2013,2.0
6,965,1971,Graduation,Divorced,55635.0,0.0,13.11.2012,4.0
7,6177,1985,PhD,Married,33454.0,1.0,08.05.2013,2.0
8,4855,1974,PhD,Together,30351.0,1.0,06.06.2013,1.0
9,5899,1950,PhD,Together,5648.0,1.0,13.03.2014,1.0
10,1994,1983,Graduation,MARRIED,NaN,NaN,NaN,NaN
11,387,1976,Basic,Married,7500.0,0.0,13.11.2012,1.0
12,2125,1959,Graduation,Divorced,63033.0,0.0,15.11.2013,1.0
13,8180,1952,Master,Divorced,59354.0,1.0,15.11.2013,3.0
14,2569,1987,Graduation,Married,17323.0,0.0,10.10.2012,1.0
15,2114,1946,PhD,SINGL,82800.0,0.0,24.11.2012,1.0
16,9736,1980,Graduation,Married,41850.0,1.0,24.12.2012,3.0
17,4939,1946,Graduation,Together,37760.0,0.0,31.08.2012,2.0
18,6565,1949,Master,Married,76995.0,0.0,28.03.2013,2.0
19,9360,1982,Graduation,Married,37040.0,0.0,08.08.2012,1.0

2.2 Оценка данных с помощью метода info.

In [3]:
# выполнит метод info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 796 entries, 0 to 795
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 796 non-null    int64
 1   Year_Birth         796 non-null    int64
 2   Education          796 non-null    object
 3   Marital_Status     796 non-null    object
 4   Income             784 non-null    float64
 5   Kidhome            795 non-null    float64
 6   Dt_Customer        795 non-null    object
 7   NumDealsPurchases  795 non-null    float64
dtypes: float64(3), int64(2), object(3)
memory usage: 49.9+ KB

2.3 Оценка данных с помощью метода describe.

In [4]:
# оцените числовые столбцы с помощью describe
df.describe()

                 ID   Year_Birth        Income     Kidhome  NumDealsPurchases
count    796.000000   796.000000     784.00000  795.000000         795.000000
mean    5630.133166  1968.356784   53130.07398    0.438994           2.314465
std     3273.039715    12.022132   21818.56876    0.547252           1.941650
min        0.000000  1899.000000    2447.00000    0.000000           0.000000
25%     2853.000000  1959.000000   36141.75000    0.000000           1.000000
50%     5563.000000  1969.500000   52372.50000    0.000000           2.000000
75%     8584.250000  1977.000000   69293.25000    1.000000           3.000000
max    11191.000000  1995.000000  162397.00000    2.000000          15.000000

Сохраним среднее значение зарплаты в переменную

In [5]:
mean_income = 53130

- count: Общее количество ненулевых значений в каждом столбце.
- mean: Среднее (mean) значение в столбце.
- std: Стандартное отклонение, показывающее разброс значений.
- min: Минимальное значение в столбце.
- 25%: 25-й процентиль (Q1), то есть 25 % точек данных меньше этого значения.
- 50%: Медианное значение (50-й процентиль), при котором половина точек данных находится ниже него.
- 75%: 75-й процентиль (Q3) означает, что 75 % точек данных находятся ниже этого значения.
- max: Максимальное значение в столбце.

In [6]:
percentiles = [.01, .99]
df.describe(percentiles=percentiles)

                 ID   Year_Birth        Income     Kidhome  NumDealsPurchases
count    796.000000   796.000000     784.00000  795.000000         795.000000
mean    5630.133166  1968.356784   53130.07398    0.438994           2.314465
std     3273.039715    12.022132   21818.56876    0.547252           1.941650
min        0.000000  1899.000000    2447.00000    0.000000           0.000000
1%       111.950000  1944.000000   10126.51000    0.000000           0.000000
50%     5563.000000  1969.500000   52372.50000    0.000000           2.000000
99%    11084.200000  1991.050000   99319.81000    2.000000           9.000000
max    11191.000000  1995.000000  162397.00000    2.000000          15.000000

Благодаоря выбору других процентых соотношений видно, что у 1 процента людей зарплата меньше 10к, а у 99 процентов меньше 100к. На фоне этого минимальная и максимальная зарплата выглядят подозрительно. Однако так как нет информации о источнике получения данных и категории опрашиваемых, подобные зарплаты могут не быть ошибкой.


---

**Сделать выводы. Вы должны понимать, что означает тот или иной столбец, чтобы
 ответить на вопросы на защите.**


 ---

2.4 Оценка названий столбцов

In [7]:
 # Вывести на экран названия столбцов с помощью df.columns. Выявить проблемы с названиями, если они есть. При необходимости переименовать столбцы. Если проблемы не обнаружены также дать пояснения.
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Dt_Customer', 'NumDealsPurchases'],
      dtype='object')

In [8]:
df = df.rename(columns={'Kidhome': 'Children', 
                        'Dt_Customer': 'Date_Registration', 
                        'NumDealsPurchases': 'Quantity_Purchases'})

Лишних пробелов в столбцах нет, однако названия все равно были частично изменены. Столбцы приведены к единому стилю написания через символ «_», а также полностью изменены несколько названий, чтобы они отражали логический смысл столбца.

### 3. Проверка пропусков

In [9]:
# Проверить данные на наличие пропусков и устранить их, если они есть (пропуски необходимо либо удалить, либо заменить каким-то значением).
df.isna().sum()

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                12
Children               1
Date_Registration      1
Quantity_Purchases     1
dtype: int64

Заполним пропуски в столбце зарплаты средней. Затем снова проверим кол-во пропусков

In [10]:
df['Income'] = df['Income'].fillna(mean_income)
df.isna().sum()

ID                    0
Year_Birth            0
Education             0
Marital_Status        0
Income                0
Children              1
Date_Registration     1
Quantity_Purchases    1
dtype: int64

Были выведены все строки, содержащие пропуски. Так как это оказалась одна строка с пропусками в 3х столбцах, было решено, что проще ее удалить. Из-за удаления строки сбилась индексация, поэтому обновили ее. После снова был вызван метод isna(), чтобы убедиться в отсутствии пропусков

In [11]:
df[df.isna().any(axis=1)]

,ID,Year_Birth,Education,Marital_Status,Income,Children,Date_Registration,Quantity_Purchases
10,1994,1983,Graduation,MARRIED,53130.0,NaN,NaN,NaN

In [12]:
df.drop(10, inplace=True)

In [13]:
df = df.reset_index(drop=True)

In [14]:
print(df.isna().sum())

ID                    0
Year_Birth            0
Education             0
Marital_Status        0
Income                0
Children              0
Date_Registration     0
Quantity_Purchases    0
dtype: int64


---

**Вы должны аргументировать на защите, почему были выполнены те или иные действия с пропусками, а также знать другие способы работы с пропусками, чтобы
 ответить на вопросы на защите.**


 ---

### 4. Проверка дубликатов

#### Проверка явных дубликатов

С помощью метода duplicated были найдены строки дубликаты. После эти дубликаты были удалены, а индексация обновлена.

In [15]:
df[df.duplicated()]

,ID,Year_Birth,Education,Marital_Status,Income,Children,Date_Registration,Quantity_Purchases
791,2853,1980,Graduation,Single,51766.0,1.0,11.03.2014,2.0
792,2853,1980,Graduation,Single,51766.0,1.0,11.03.2014,2.0
793,2853,1980,Graduation,Single,51766.0,1.0,11.03.2014,2.0
794,2853,1980,Graduation,Single,51766.0,1.0,11.03.2014,2.0

In [16]:
# удалите дубликаты, если они есть
df = df.drop_duplicates().reset_index(drop=True)# аргумент drop, чтобы не создавать столбец index

#### Проверка неявных дубликатов

Были выведены уникальные значения для столбцов Education и Marital_Status, а также сколько раз каждое значение встретилось. В столбце Education неявных дубликатов нет.

In [17]:
print(df['Education'].unique()) # Поиск уникальных значений
print(df['Marital_Status'].unique()) # Поиск уникальных значений

['Graduation' 'PhD' 'Master' 'Basic']
['Single' 'Together' 'Married' 'Divorced' 'SINGL' 'MARRIED' 'Widow'
 'Alone']

In [18]:
print(df["Education"].value_counts())
df["Marital_Status"].value_counts()

Education
Graduation    439
PhD           190
Master        147
Basic          15
Name: count, dtype: int64

Marital_Status
Married     305
Together    193
Single      174
Divorced     85
Widow        29
Alone         3
MARRIED       1
SINGL         1
Name: count, dtype: int64

Сначала все поля были приведены к одному регистру. Затем заменены неявные дубликаты. Повторно были выведены уникальные значения, чтобы убедиться в отсутствии неявных дубликатов

In [19]:
# удалите дубликаты, если они есть
df['Marital_Status'] = df['Marital_Status'].str.capitalize()
df['Marital_Status'] = df['Marital_Status'].replace(['Alone', 'Singl'], 'Single')
df['Marital_Status'].unique()

array(['Single', 'Together', 'Married', 'Divorced', 'Widow'], dtype=object)

---

**Вы должны аргументировать на защите, почему были выполнены те или иные действия с дубликатами, знать, что такое явные и неявные дубликаты и способы работы с ними, чтобы ответить на вопросы на защите.**


 ---

### 5. Провека типов данных

Для наглядности была повторно выведена информация о типах данных. Сначала были изменены типы с float на int для столбцов Children и Quantity_Purchases. Затем для столбца с датой с object на datetime64

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 791 entries, 0 to 790
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  791 non-null    int64
 1   Year_Birth          791 non-null    int64
 2   Education           791 non-null    object
 3   Marital_Status      791 non-null    object
 4   Income              791 non-null    float64
 5   Children            791 non-null    float64
 6   Date_Registration   791 non-null    object
 7   Quantity_Purchases  791 non-null    float64
dtypes: float64(3), int64(2), object(3)
memory usage: 49.6+ KB

In [21]:
df['Children'] = df['Children'].astype(int)
df['Quantity_Purchases'] = df['Quantity_Purchases'].astype(int)
# df = df.astype({
#     "Children": int,
#     "Quantity_Purchases": int
# })

In [22]:
df['Date_Registration'] = pd.to_datetime(df['Date_Registration'], format='%d.%m.%Y')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 791 entries, 0 to 790
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  791 non-null    int64
 1   Year_Birth          791 non-null    int64
 2   Education           791 non-null    object
 3   Marital_Status      791 non-null    object
 4   Income              791 non-null    float64
 5   Children            791 non-null    int64
 6   Date_Registration   791 non-null    datetime64[ns]
 7   Quantity_Purchases  791 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(2)
memory usage: 49.6+ KB

In [23]:
# Проверьте типы данных, при необходимости измените типы данных, чтобы они соответствовали действительности.

---

**Обратите внимание, что во всех вариантах необходимо сделать приведение типов. Будьте готовы на защите аргументировать проверку типов (почему выполнены те или иные преобразования).**


 ---

### 6. Группировка данных

#### Задание 1

*`Группировка - тип образования по каждому семейному статусу (marital_status)`*

In [24]:
df.groupby(['Education', 'Marital_Status'])['Marital_Status'].count()

Education   Marital_Status
Basic       Divorced            1
            Married             9
            Single              1
            Together            4
Graduation  Divorced           49
            Married           170
            Single            103
            Together           96
            Widow              21
Master      Divorced           12
            Married            57
            Single             32
            Together           42
            Widow               4
PhD         Divorced           23
            Married            70
            Single             42
            Together           51
            Widow               4
Name: Marital_Status, dtype: int64

**`Сделайте вывод - интерпретацию - что можно увидеть из результата данной группировки?`**

Чем выше образование, тем больше людей состоит в официальном браке (Married). Второе по популярности состояние — Together (гражданский брак). Single и Divorced занимают средние позиции. Widow — редкая категория. Можно предположить, что более образованные люди чаще вступают в брак (и/или чаще остаются в браке), но при этом среди них распространено и сожительство (Together).

---

**Обратите внимание, что на защите вы должны ориентироваться в синтаксисе. При необходимости нужно быть готовым изменить код по просьбе преподавателя. Например, вместо среднего значения подсчитать медиану и т.д.**


 ---

#### Задание 2

*`Группировка - семейный статус (marital_status) по количеству детей.
Создать датафрейм. Переименовать столбец с количеством в “сount”.
Отсортировать по убыванию столбца “count”. `*

Была выполнена групировка с подсчетом колличества. Затем серия была отсортирована и преобразована в ДФ с созданием столбца count

In [25]:
# выполните группировку согласно варианту
df_child = df.groupby(['Marital_Status', 'Children'])['Children']\
    .count().sort_values(ascending = False).reset_index(name="count")
df_child

   Marital_Status  Children  count
0         Married         0    169
1         Married         1    125
2        Together         0    124
3          Single         0     98
4          Single         1     76
5        Together         1     66
6        Divorced         0     52
7        Divorced         1     31
8           Widow         0     24
9         Married         2     12
10          Widow         1      5
11         Single         2      4
12       Together         2      3
13       Divorced         2      2

**`Сделайте вывод - интерпретацию - что можно увидеть из результата данной группировки?`**

Из таблицы видно, что большинство клиентов состоят в браке или в отношениях (Married, Together) и чаще всего у них нет детей или только один ребёнок. Холостых и разведённых тоже много, но они заметно реже встречаются с детьми. Вдовцов очень мало.

Итог: основная аудитория — семейные пары без детей или с одним ребёнком.

---

**Обратите внимание, что на защите вы должны ориентироваться в синтаксисе. При необходимости нужно быть готовым изменить код по просьбе преподавателя. Например, вместо среднего значения подсчитать медиану и т.д.**


 ---

#### Задание 3

*`Сводная таблица (pivot_table) - средний доход семьи по семейному
положению. Отсортировать по убыванию. Округлить до двух знаков.`*

In [26]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Children,Date_Registration,Quantity_Purchases
0,5524,1957,Graduation,Single,58138.0,0,2012-09-04,3
1,2174,1954,Graduation,Single,46344.0,1,2014-03-08,2
2,4141,1965,Graduation,Together,71613.0,0,2013-08-21,1
3,6182,1984,Graduation,Together,26646.0,1,2014-02-10,2
4,5324,1981,PhD,Married,58293.0,1,2014-01-19,5

In [27]:
# выполните сводную таблицу согласно варианту
df_mean_income = df.pivot_table(index=['Marital_Status'], values='Income', aggfunc='mean')

In [28]:
df_mean_income = df_mean_income.sort_values(by="Income", ascending=False).round(2)
df_mean_income

                  Income
Marital_Status
Widow           55452.45
Divorced        54568.16
Together        54495.73
Married         52901.37
Single          51008.06

**`Сделайте вывод - интерпретацию - что можно увидеть из результата данной сводной таблицы?`**

Более высокий доход характерен для людей, которые уже были или находятся в долгосрочных отношениях (вдовы, разведённые, сожители), а наименьший — у одиноких.

---

**Обратите внимание, что на защите вы должны ориентироваться в синтаксисе. При необходимости нужно быть готовым изменить код по просьбе преподавателя. Например, вместо среднего значения подсчитать медиану и т.д.**


 ---

#### Задание 4

*` Сводная таблица (pivot_table) - среднее количество покупок по уровню
образованию - строки и году рождения - столбцы. Отсортировать по возрастанию
education. Округлить до двух знаков`*

In [29]:
# выполните сводную таблицу согласно варианту
df_mean_purchases = df.pivot_table(index=['Education'], columns = 'Year_Birth', values='Quantity_Purchases', aggfunc='mean')

In [30]:
df_mean_purchases = df_mean_purchases.round(2).sort_index()
df_mean_purchases

Year_Birth,1899,1941,1943,1944,1945,1946,1947,1948,1949,1950,...,1986,1987,1988,1989,1990,1991,1992,1993,1994,1995
Education,,,,,,,,,,,,,,,,,,,,,
Basic,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2.00,2.00,NaN,1.00,1.0,NaN,NaN,NaN,NaN,NaN
Graduation,NaN,NaN,NaN,1.0,NaN,1.67,1.0,1.00,1.0,2.00,...,1.12,1.67,1.92,1.78,1.0,1.0,1.0,1.0,1.0,1.0
Master,NaN,NaN,1.0,1.0,1.0,1.00,1.0,1.00,2.2,5.00,...,2.50,1.00,1.00,2.00,NaN,NaN,1.0,NaN,NaN,NaN
PhD,1.0,0.0,1.5,1.0,1.5,2.00,1.0,2.43,2.5,1.67,...,1.50,NaN,1.00,1.00,NaN,1.0,NaN,NaN,NaN,NaN

Уровень образования влияет на среднее количество покупок. Люди с PhD и Master чаще совершают больше покупок (значения 2.0 и выше встречаются чаще). У людей с Graduation средние значения стабильные, но чуть ниже (в районе 1.0–1.9). У обладателей Basic образования покупки встречаются редко (данных мало, в основном 1–2 покупки, много пропусков). Также видно, что для разных годов рождения есть разброс, но глобально тренд такой: чем выше образование, тем активнее совершают покупки. Эти выводы можно подтвердить сделав сводную таблицу средних покупок по образованию без разграничения по году рождения.

In [31]:
df.pivot_table(index=['Education'], values='Quantity_Purchases', aggfunc='mean')

            Quantity_Purchases
Education
Basic                 1.400000
Graduation            2.177677
Master                2.523810
PhD                   2.547368

**`Сделайте вывод - интерпретацию - что можно увидеть из результата выполнения данного кода?`**

---

**Обратите внимание, что на защите вы должны ориентироваться в синтаксисе. При необходимости нужно быть готовым изменить код по просьбе преподавателя. Например, вместо среднего значения подсчитать медиану и т.д.**


 ---

### Вывод


***`Сделать расширенный вывод. `***

Вывод должен описывать результаты исследования: какой набор данных вы анализировали (предметная область), какие методы предобработки применили, какие выводы из группировок и сводных таблиц можно сделать (они могут повторять выводы выше) и т.п. Объём вывода, как правило не более 0.5-0.75 страницы А4, всё таки вывод должен быть конкретным (без теории и “воды”).

В работе был проведён анализ набора данных, содержащего информацию о клиентах магазина. Данные включали уникальный идентификатор клиента, год рождения, уровень образования, семейное положение, годовой доход семьи, количество детей, дату регистрации и количество покупок.

Перед анализом была выполнена предобработка данных: проверка наличия пропусков, преобразование типов данных (например, перевод некоторых столбцов к числовым типам), а также использование методов группировки и сводных таблиц для выявления закономерностей.

Проведённый анализ показал, что уровень образования и семейное положение оказывают заметное влияние на поведение клиентов. Так, клиенты с образованием уровня Master и PhD совершают больше покупок, чем обладатели базового образования. Также выявлено, что семейные пары и сожители покупают чаще, чем одинокие клиенты, а наибольший средний доход наблюдается у вдовцов и разведённых.

В целом результаты анализа показывают, что ключевая группа клиентов магазина — это семейные пары со средним или высоким уровнем образования, в основном без детей или с одним ребёнком, обладающие стабильным доходом и демонстрирующие более высокую покупательскую активность. Эти данные могут быть полезны для сегментации аудитории и разработки маркетинговых стратегий.

### Дополнительное задание

**`Подробная формулировка задания`**

номера заданий
2
8
16
23

2. Создать столбец - возраст (расчетный). Создать столбец “Категория
возраста (Year_Birth)” (с помощью категоризации). Выделить минимум 3
категории (молодой, старый, средний), фильтрацию для уровня возраста
выбрать самостоятельно, аргументировать выбор. Создать сводную
таблицу: средний и медианный возраст по Marital_Status и категории
возраста.

In [32]:
# Рассчитаем возраст
df['Age'] = 2025 - df['Year_Birth']  # берём текущий год 2025, чтобы пример был актуален

# Категории возраста: молодой (<35), средний (35-55), старый (>55)
bins = [0, 34, 55, 100]
labels = ['Молодой', 'Средний', 'Старый']
df['Age_Category'] = pd.cut(df['Age'], bins=bins, labels=labels)

# Создание сводной таблицы: средний и медианный возраст по семейному положению и категории возраста
pivot_age = df.pivot_table(
    index='Marital_Status',
    columns='Age_Category',
    values='Age',
    aggfunc=['mean', 'median'],
    observed=False
).round(1)

pivot_age

                  mean                 median
Age_Category   Молодой Средний Старый Молодой Средний Старый
Marital_Status
Divorced           NaN    49.1   65.6     NaN    49.0   64.0
Married           33.5    47.3   65.9    33.5    49.0   65.0
Single            32.3    46.2   65.5    33.0    47.0   65.0
Together          33.0    47.5   67.3    33.5    48.0   67.0
Widow              NaN    51.9   68.0     NaN    52.0   69.0

Вывод:
Средний и медианный возраст естественно растёт от категории «Молодой» к «Старый».

Молодые категории почти отсутствуют среди вдовцов и разведённых, что логично.

Наибольший возраст наблюдается у «Старых» вдовцов и людей в отношениях (Together).

В целом таблица подтверждает корректность классификации возраста и показывает распределение возрастных категорий по семейному положению.

8. Создать столбец “Категория дохода (Income)” (с помощью категоризации).
Выделить минимум 3 категории (высокий, низкий, средний), фильтрацию
для уровня дохода выбрать самостоятельно, аргументировать выбор.
Создать группировки: средний, максимальный, минимальный и медианный
NumDealsPurchases категории дохода и средний, максимальный,
минимальный и медианный Income по категории дохода.

In [33]:
# Категории дохода: низкий (<40k), средний (40k-70k), высокий (>70k)
bins_income = [0, 40000, 70000, df['Income'].max()]
labels_income = ['Низкий', 'Средний', 'Высокий']
df['Income_Category'] = pd.cut(df['Income'], bins=bins_income, labels=labels_income)

# Группировки: Quantity_Purchases и Income по категории дохода
grouped_income = df.groupby('Income_Category', observed=False).agg({
    'Quantity_Purchases': ['mean', 'max', 'min', 'median'],
    'Income': ['mean', 'max', 'min', 'median']
}).round(1)

grouped_income

                Quantity_Purchases                  Income                     \
                              mean max min median     mean       max      min
Income_Category
Низкий                         2.0  15   0    2.0  28137.1   39747.0   2447.0
Средний                        3.0  13   0    2.0  55066.5   69882.0  40049.0
Высокий                        1.5  15   0    1.0  81039.6  162397.0  70165.0


                  median
Income_Category
Низкий           29968.5
Средний          54456.0
Высокий          78935.0

Вывод:
Среднее количество покупок выше у клиентов со средним доходом (3 покупки), чуть меньше у низкого дохода (2) и минимально у высокодоходных (1,5).

Максимальные покупки встречаются во всех категориях (до 15), но медианное значение показывает, что большинство высокодоходных клиентов делают меньше покупок.

Доходы распределены логично: низкий доход — около 28–30 тыс., средний — 55–69 тыс., высокий — 81–162 тыс.

В целом наблюдается обратная зависимость между количеством покупок и уровнем дохода: клиенты с средним доходом более активны по числу покупок.

16. Создать столбец - возраст (расчетный). Создать столбец “Категория дохода
(Income)” (с помощью категоризации). Выделить минимум 3 категории
(высокий, низкий, средний), фильтрацию для уровня дохода выбрать
самостоятельно, аргументировать выбор. Выполнить фильтрацию: выбрать
записи только с высоким доходом + людей старше определенного возраста
(возраст выбрать самостоятельно, чтобы в выборке было достаточное
количество записей) + топ 2 типа образования (Education) по популярности.
Создать сводные таблицы: средний и медианный Income по категории
дохода и Marital_Status .

In [34]:
# Рассчёт возраста уже сделан в задании 2
# Категории дохода уже созданы в задании 8

# Определяем топ-2 образования по популярности
top_edu = df['Education'].value_counts().nlargest(2).index

# Фильтрация: высокий доход, возраст > 40, топ-2 образования
filtered = df[
    (df['Income_Category'] == 'Высокий') &
    (df['Age'] > 40) &
    (df['Education'].isin(top_edu))
]

# Сводные таблицы: средний и медианный Income по категории дохода и семейному положению
pivot_high = filtered.pivot_table(
    index='Marital_Status',
    columns='Income_Category',
    values='Income',
    aggfunc=['mean', 'median'],
    observed=False
).round(1)

pivot_high

                    mean   median
Income_Category  Высокий  Высокий
Marital_Status
Divorced         85839.4  81702.0
Married          81410.1  79561.5
Single           79670.8  79684.0
Together         81301.6  77337.0
Widow            77468.4  79800.0

Вывод:
Среди клиентов с высоким доходом средний и медианный доход колеблется от ~77 тыс. до ~86 тыс.

Наибольший средний доход у разведённых (≈85,8 тыс.), чуть ниже — у женатых и сожителей (≈81–81,3 тыс.).

Вдовцы имеют самый низкий средний доход (~77,5 тыс.), но медианный показатель немного выше, что указывает на наличие нескольких очень богатых клиентов среди других категорий.

В целом различия по семейному положению не слишком большие, но разведённые клиенты демонстрируют наибольшую покупательскую финансовую активность.

23. Создать столбец - возраст (расчетный). Создать столбец “Категория
возраста (Year_Birth)” (с помощью категоризации). Выделить минимум 3
категории (молодой, старый, средний), фильтрацию для уровня возраста
выбрать самостоятельно, аргументировать выбор. Создать столбец
“Категория дохода (Income)” (с помощью категоризации). Выделить
минимум 3 категории (высокий, низкий, средний), фильтрацию для уровня
дохода выбрать самостоятельно, аргументировать выбор. Выполнить
фильтрацию: выбрать записи только с низким и средним доходом + людей
молодого и среднего возраста + топ 3 семейных статуса (Marital_Status) с
максимальным медианным доходом + топ 2 типа образования по
популярности. Создать сводные таблицы: средний и медианный
NumDealsPurchases по Education и Marital_Status; средний income по
категории дохода и Kidhome.

In [35]:
# Возраст и категории уже созданы в задании 2
# Категории дохода уже созданы в задании 8

# Топ-3 семейных статуса по медианному доходу
top_marital = df.groupby('Marital_Status')['Income'].median().nlargest(3).index

# Топ-2 образования по популярности
top_edu = df['Education'].value_counts().nlargest(2).index

# Фильтрация: низкий/средний доход, молодой/средний возраст, топ семейного статуса и топ образования
filtered = df[
    (df['Income_Category'].isin(['Низкий','Средний'])) &
    (df['Age_Category'].isin(['Молодой','Средний'])) &
    (df['Marital_Status'].isin(top_marital)) &
    (df['Education'].isin(top_edu))
]

# Сводные таблицы
pivot_numdeals = filtered.pivot_table(
    index='Education',
    columns='Marital_Status',
    values='Quantity_Purchases',
    aggfunc=['mean', 'median'],
    observed=False
).round(1)

pivot_income_kid = filtered.pivot_table(
    index='Income_Category',
    columns='Children',
    values='Income',
    aggfunc='mean',
    observed=False
).round(1)

display(pivot_numdeals)
pivot_income_kid

                   mean                  median
Marital_Status Divorced Together Widow Divorced Together Widow
Education
Graduation          2.4      2.0   1.9      2.0      2.0   1.5
PhD                 2.2      2.1   NaN      2.5      1.0   NaN

Children               0        1        2
Income_Category
Низкий               NaN  29143.2  16626.0
Средний          56597.5  53098.8      NaN

Вывод: 
По покупательской активности (NumDealsPurchases) видно, что среди клиентов с образованием Graduation показатели выше у разведённых (≈2.4) и несколько ниже у вдов (≈1.9). У клиентов с PhD активность колеблется, при этом медианные значения достаточно низкие.

По доходу чётко выделяются клиенты со средним доходом (≈53–57 тыс.), в то время как у группы с низким доходом значения значительно ниже (≈16–29 тыс.).

Наибольший вклад в доход и активность дают категории клиентов со средним доходом и образованием уровня Graduation.

Таким образом, сегмент «средний доход + образование Graduation + разведённые» выглядит наиболее перспективным для маркетингового внимания.

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 791 entries, 0 to 790
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  791 non-null    int64
 1   Year_Birth          791 non-null    int64
 2   Education           791 non-null    object
 3   Marital_Status      791 non-null    object
 4   Income              791 non-null    float64
 5   Children            791 non-null    int64
 6   Date_Registration   791 non-null    datetime64[ns]
 7   Quantity_Purchases  791 non-null    int64
 8   Age                 791 non-null    int64
 9   Age_Category        790 non-null    category
 10  Income_Category     791 non-null    category
dtypes: category(2), datetime64[ns](1), float64(1), int64(5), object(2)
memory usage: 57.5+ KB

***`Подробный вывод по заданию, описание полученных результатов`***